In [86]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### BÃ i 1:

In [87]:
employee1 = pd.read_csv(r'C:\Users\Laptop EDG\Downloads\HW5\employee_01.csv',header=None)
employee1.head(7)

   0      1      2    3
0  1    Joe  70000    3
1  2  Henry  80000    4
2  3    Sam  60000  NaN
3  4    Max  90000

In [88]:
employee1.columns=['Id','Name','Salary','ManagerId']
employee1

   Id   Name  Salary ManagerId
0   1    Joe   70000         3
1   2  Henry   80000         4
2   3    Sam   60000       NaN
3   4    Max   90000

In [89]:
employee1.dtypes

Id            int64
Name         object
Salary        int64
ManagerId    object
dtype: object

In [90]:
employee1.ManagerId=[3,4,0,0]

In [91]:
employee1.dtypes

Id            int64
Name         object
Salary        int64
ManagerId     int64
dtype: object

In [92]:
new=employee1.merge(employee1, how='left',left_on='ManagerId',right_on='Id')
new

   Id_x Name_x  Salary_x  ManagerId_x  Id_y Name_y  Salary_y  ManagerId_y
0     1    Joe     70000            3   3.0    Sam   60000.0          0.0
1     2  Henry     80000            4   4.0    Max   90000.0          0.0
2     3    Sam     60000            0   NaN    NaN       NaN          NaN
3     4    Max     90000            0   NaN    NaN       NaN          NaN

In [93]:
new[new.Salary_x>new.Salary_y][['Name_x']]

  Name_x
0    Joe

### BÃ i 2:

In [94]:
employee2 = pd.read_csv(r'C:\Users\Laptop EDG\Downloads\HW5\employee_02.csv',header=None)
employee2.columns=['Id','Name','Salary','DepartmentId']
employee2

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [95]:
department = pd.read_csv(r'C:\Users\Laptop EDG\Downloads\HW5\department.csv',header=None)
department.columns=['Id','Name']
department

   Id   Name
0   1     IT
1   2  Sales

In [96]:
new2=employee2.merge(department,how='left',left_on='DepartmentId',right_on='Id')
new2

   Id_x Name_x  Salary  DepartmentId  Id_y Name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     3  Henry   80000             2     2  Sales
3     4    Sam   60000             2     2  Sales
4     5    Max   90000             1     1     IT

In [97]:
new2.drop(columns=['DepartmentId','Id_y'],inplace=True)
new2

   Id_x Name_x  Salary Name_y
0     1    Joe   70000     IT
1     2    Jim   90000     IT
2     3  Henry   80000  Sales
3     4    Sam   60000  Sales
4     5    Max   90000     IT

In [98]:
new2.columns=['Id','Employee','Salary','Department']
new2

   Id Employee  Salary Department
0   1      Joe   70000         IT
1   2      Jim   90000         IT
2   3    Henry   80000      Sales
3   4      Sam   60000      Sales
4   5      Max   90000         IT

In [99]:
for name, group in new2.groupby('Department'):
    print(group[group.Salary==group.Salary.max()])

   Id Employee  Salary Department
1   2      Jim   90000         IT
4   5      Max   90000         IT
   Id Employee  Salary Department
2   3    Henry   80000      Sales